In [12]:
import sqlite3
con = sqlite3.connect("products.db")
cur = con.cursor()

In [13]:
cur.execute("DROP TABLE IF EXISTS Manufacturers")
cur.execute("DROP TABLE IF EXISTS Products")

In [14]:
cur.execute("""
    CREATE TABLE IF NOT EXISTS Departments (
        Code INTEGER,
        Name TEXT NOT NULL,
        Budget decimal NOT NULL,
        PRIMARY KEY (Code)   
);
""")

cur.execute("""
    CREATE TABLE IF NOT EXISTS Employees (
        SSN INTEGER,
        Name varchar(255) NOT NULL ,
        LastName varchar(255) NOT NULL ,
        Department INTEGER NOT NULL , 
        PRIMARY KEY (SSN)   
);
""")

In [15]:
cur.executescript("""
INSERT INTO Departments(Code,Name,Budget) VALUES(14,'IT',65000);
INSERT INTO Departments(Code,Name,Budget) VALUES(37,'Accounting',15000);
INSERT INTO Departments(Code,Name,Budget) VALUES(59,'Human Resources',240000);
INSERT INTO Departments(Code,Name,Budget) VALUES(77,'Research',55000);

INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('123234877','Michael','Rogers',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('152934485','Anand','Manikutty',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('222364883','Carol','Smith',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('326587417','Joe','Stevens',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332154719','Mary-Anne','Foster',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332569843','George','ODonnell',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('546523478','John','Doe',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('631231482','David','Smith',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('654873219','Zacary','Efron',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('745685214','Eric','Goldsmith',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657245','Elizabeth','Doe',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657246','Kumar','Swamy',14);
""")

IntegrityError: UNIQUE constraint failed: Departments.Code

In [16]:
def run(cmd):
    r = cur.execute(cmd)
    display(r.fetchall())

## 2.1 Select the last name of all employees.

In [17]:
run("""
SELECT LastName 
FROM Employees
""")

[('Rogers',),
 ('Manikutty',),
 ('Smith',),
 ('Stevens',),
 ('Foster',),
 ('ODonnell',),
 ('Doe',),
 ('Smith',),
 ('Efron',),
 ('Goldsmith',),
 ('Doe',),
 ('Swamy',)]

## 2.2 Select the last name of all employees, without duplicates.

In [18]:
run("""
SELECT DISTINCT LastName 
FROM Employees
""")

[('Rogers',),
 ('Manikutty',),
 ('Smith',),
 ('Stevens',),
 ('Foster',),
 ('ODonnell',),
 ('Doe',),
 ('Efron',),
 ('Goldsmith',),
 ('Swamy',)]

## 2.3 Select all the data of employees whose last name is "Smith".

In [22]:
run("""
SELECT * 
FROM Employees
WHERE LastName = 'Smith'
""")

[(222364883, 'Carol', 'Smith', 37), (631231482, 'David', 'Smith', 77)]

## 2.4 Select all the data of employees whose last name is "Smith" or "Doe".

In [23]:
run("""
SELECT * 
FROM Employees
WHERE LastName = 'Smith' OR LastName = 'Doe'
""")

[(222364883, 'Carol', 'Smith', 37),
 (546523478, 'John', 'Doe', 59),
 (631231482, 'David', 'Smith', 77),
 (845657245, 'Elizabeth', 'Doe', 14)]

## 2.5 Select all the data of employees that work in department 14.

In [38]:
run("""
SELECT * 
FROM Employees
WHERE Department = 14
""")

[(123234877, 'Michael', 'Rogers', 14),
 (152934485, 'Anand', 'Manikutty', 14),
 (332154719, 'Mary-Anne', 'Foster', 14),
 (845657245, 'Elizabeth', 'Doe', 14),
 (845657246, 'Kumar', 'Swamy', 14)]

## 2.6 Select all the data of employees that work in department 37 or department 77.

In [37]:
run("""
SELECT * 
FROM Employees 
WHERE Department = 37 OR Department = 77
""")

[(222364883, 'Carol', 'Smith', 37),
 (326587417, 'Joe', 'Stevens', 37),
 (332569843, 'George', 'ODonnell', 77),
 (631231482, 'David', 'Smith', 77)]

## 2.7 Select all the data of employees whose last name begins with an "S".

In [36]:
run("""
SELECT * 
FROM Employees 
WHERE LastName LIKE 'S%'
""")

[(222364883, 'Carol', 'Smith', 37),
 (326587417, 'Joe', 'Stevens', 37),
 (631231482, 'David', 'Smith', 77),
 (845657246, 'Kumar', 'Swamy', 14)]

## 2.8 Select the sum of all the departments' budgets.

In [47]:
run("""
SELECT 'Total Budget:' AS Name, SUM(Budget) AS Budget
FROM Departments 

UNION

SELECT Name, SUM(Budget)sum 
FROM Departments
GROUP BY Name
ORDER BY Budget;
""")

[('Accounting', 15000),
 ('Research', 55000),
 ('IT', 65000),
 ('Human Resources', 240000),
 ('Total Budget:', 375000)]

## 2.9 Select the number of employees in each department (you only need to show the department code and the number of employees).

In [44]:
run("""
SELECT Department, COUNT(*) AS number_of_employees
FROM Employees 
GROUP BY Department;
""")

[(14, 5), (37, 2), (59, 3), (77, 2)]

## 2.10 Select all the data of employees, including each employee's department's data.

In [50]:
run("""
SELECT * 
FROM Employees E 
JOIN Departments D 
ON E.Department = D.Code
ORDER BY D.Name;
""")

[(222364883, 'Carol', 'Smith', 37, 37, 'Accounting', 15000),
 (326587417, 'Joe', 'Stevens', 37, 37, 'Accounting', 15000),
 (546523478, 'John', 'Doe', 59, 59, 'Human Resources', 240000),
 (654873219, 'Zacary', 'Efron', 59, 59, 'Human Resources', 240000),
 (745685214, 'Eric', 'Goldsmith', 59, 59, 'Human Resources', 240000),
 (123234877, 'Michael', 'Rogers', 14, 14, 'IT', 65000),
 (152934485, 'Anand', 'Manikutty', 14, 14, 'IT', 65000),
 (332154719, 'Mary-Anne', 'Foster', 14, 14, 'IT', 65000),
 (845657245, 'Elizabeth', 'Doe', 14, 14, 'IT', 65000),
 (845657246, 'Kumar', 'Swamy', 14, 14, 'IT', 65000),
 (332569843, 'George', 'ODonnell', 77, 77, 'Research', 55000),
 (631231482, 'David', 'Smith', 77, 77, 'Research', 55000)]

## 2.12 Select the name and last name of employees working for departments with a budget greater than $60,000.

In [52]:
run("""
SELECT E.Name, E.LastName 
FROM Employees E 
JOIN Departments D 
ON E.Department = D.Code
WHERE Budget > 60000;
""")

[('Michael', 'Rogers'),
 ('Anand', 'Manikutty'),
 ('Mary-Anne', 'Foster'),
 ('John', 'Doe'),
 ('Zacary', 'Efron'),
 ('Eric', 'Goldsmith'),
 ('Elizabeth', 'Doe'),
 ('Kumar', 'Swamy')]

## 2.13 Select the departments with a budget larger than the average budget of all the departments.

In [55]:
run("""
SELECT Departments.Name, Budget
FROM Departments
WHERE Budget > (SELECT AVG(Budget) FROM Departments);
""")

[('Human Resources', 240000)]

## 2.14 Select the names of departments with more than two employees.

In [60]:
run("""
SELECT D.Name
FROM Employees E 
JOIN Departments D 
ON E.Department = D.Code
GROUP BY D.Name
HAVING COUNT(*) > 2;
""")

[('Human Resources',), ('IT',)]

## 2.15 Select the name and last name of employees working for the two departments with lowest budget.

In [79]:
run("""
SELECT E.Name, E.LastName, D.Name
FROM Employees E 
JOIN Departments D 
ON E.Department = D.Code
WHERE Budget < (
    SELECT AVG(Budget) 
    FROM Departments )
ORDER BY Budget LIMIT 4
;
""")

[('Carol', 'Smith', 'Accounting'),
 ('Joe', 'Stevens', 'Accounting'),
 ('George', 'ODonnell', 'Research'),
 ('David', 'Smith', 'Research')]

## 2.16  Add a new department called "Quality Assurance", with a budget of $40,000 and departmental code 11.
### And Add an employee called "Mary Moore" in that department, with SSN 847-21-9811.

In [84]:
run("""
INSERT INTO Departments (Code, Name, Budget)
VALUES (11, 'Quality Assureance', 40000)
;
""")

[]

In [85]:
run("""
INSERT INTO Employees (SSN, Name, LastName, Department)
VALUES (847219811, 'Mary', 'Moore', 11)
;
""")

[]

## 2.17 Reduce the budget of all departments by 10%.

In [87]:
run("""
UPDATE Departments 
SET Budget = Budget *.9 
;
""")

[]

## 2.18 Reassign all employees from the Research department (code 77) to the IT department (code 14).

In [88]:
run("""
UPDATE Employees 
SET Department = 14
Where Department = 77
;
""")

[]

## 2.19 Delete from the table all employees in the IT department (code 14).

In [90]:
run("""
DELETE FROM Employees 
WHERE Department = 14
;
""")

[]

## 2.20 Delete from the table all employees who work in departments with a budget greater than or equal to $60,000.

In [91]:
run("""
DELETE FROM Employees 
WHERE Department IN (
    SELECT Code 
    FROM Departments 
    WHERE Budget >= 60000)
;
""")

[]

## 2.21 Delete from the table all employees.

In [92]:
run("""
DELETE FROM Employees
;
""")

[]